#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :業務支援系商品マスタ_マージ               | T_KT41000D_OBJ
# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :業務支援系商品マスタロード                | T_KT41000D_LOAD
#                   :業務支援系商品マスタ                      | V_KT410000_SRC001
#                   :【業務支援系商品採番】公共債              | T_KT41000D_WK10
#                   :【業務支援系商品採番】保険                | T_KT41000D_WK20
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2021-08-24        :新規作成                                  | SVC TSUKINOKI
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/*#############################################*/
/* 既存商品コードを抽出（変更ありは変更日設定）*/
/*#############################################*/
INSERT INTO ${INFO_DB}.[T_KT41000D_WK91]
SELECT
   DTE.[前日]
  ,PRT.[コード階層区分１]
  ,PRT.[コード階層名称１]
  ,PRT.[コード階層区分２]
  ,PRT.[コード階層名称２]
  ,PRT.[コード階層区分３]
  ,PRT.[コード階層名称３]
  ,PRT.[コード階層区分４]
  ,PRT.[コード階層名称４]
  ,PRT.[商品コード]
  ,PRT.[商品名称]
  ,PRT.[システム使用区分１]
  ,PRT.[システム使用区分２]
  ,PRT.[システム使用区分３]
  ,PRT.[システム使用区分４]
  ,PRT.[システム使用区分５]
  ,PRT.[システム使用区分６]
  ,PRT.[システム使用区分７]
  ,PRT.[システム使用区分８]
  ,PRT.[システム使用区分９]
  ,PRT.[システム使用区分１０]
  ,PRT.[システム使用区分１１]
  ,PRT.[システム使用区分１２]
  ,PRT.[システム使用区分１３]
  ,PRT.[システム使用区分１４]
  ,PRT.[システム使用区分１５]
  ,PRT.[登録種別]
  ,PRT.[登録日]
  ,CASE WHEN    PRT.[コード階層区分１]     <> MST.[コード階層区分１]
             OR PRT.[コード階層名称１]     <> MST.[コード階層名称１]
             OR PRT.[コード階層区分２]     <> MST.[コード階層区分２]
             OR PRT.[コード階層名称２]     <> MST.[コード階層名称２]
             OR PRT.[コード階層区分３]     <> MST.[コード階層区分３]
             OR PRT.[コード階層名称３]     <> MST.[コード階層名称３]
             OR PRT.[コード階層区分４]     <> MST.[コード階層区分４]
             OR PRT.[コード階層名称４]     <> MST.[コード階層名称４]
             OR PRT.[商品名称]             <> MST.[商品名称]
             OR PRT.[システム使用区分１]   <> MST.[システム使用区分１]
             OR PRT.[システム使用区分２]   <> MST.[システム使用区分２]
             OR PRT.[システム使用区分３]   <> MST.[システム使用区分３]
             OR PRT.[システム使用区分４]   <> MST.[システム使用区分４]
             OR PRT.[システム使用区分５]   <> MST.[システム使用区分５]
             OR PRT.[システム使用区分６]   <> MST.[システム使用区分６]
             OR PRT.[システム使用区分７]   <> MST.[システム使用区分７]
             OR PRT.[システム使用区分８]   <> MST.[システム使用区分８]
             OR PRT.[システム使用区分９]   <> MST.[システム使用区分９]
             OR PRT.[システム使用区分１０] <> MST.[システム使用区分１０]
             OR PRT.[システム使用区分１１] <> MST.[システム使用区分１１]
             OR PRT.[システム使用区分１２] <> MST.[システム使用区分１２]
             OR PRT.[システム使用区分１３] <> MST.[システム使用区分１３]
             OR PRT.[システム使用区分１４] <> MST.[システム使用区分１４]
             OR PRT.[システム使用区分１５] <> MST.[システム使用区分１５]
             OR PRT.[登録種別]             <> MST.[登録種別]
             OR PRT.[登録日]               <> MST.[登録日]
             OR PRT.[削除フラグ]           <> MST.[削除フラグ]
             OR PRT.[備考]                 <> MST.[備考]
        THEN DTE.[前日]
        ELSE MST.[更新日]
   END AS [更新日]
  ,PRT.[削除フラグ]
  ,PRT.[備考]
FROM
(
  SELECT
     [コード階層区分１]
    ,[コード階層名称１]
    ,[コード階層区分２]
    ,[コード階層名称２]
    ,[コード階層区分３]
    ,[コード階層名称３]
    ,[コード階層区分４]
    ,[コード階層名称４]
    ,[商品コード]
    ,[商品名称]
    ,[システム使用区分１]
    ,[システム使用区分２]
    ,[システム使用区分３]
    ,[システム使用区分４]
    ,[システム使用区分５]
    ,[システム使用区分６]
    ,[システム使用区分７]
    ,[システム使用区分８]
    ,[システム使用区分９]
    ,[システム使用区分１０]
    ,[システム使用区分１１]
    ,[システム使用区分１２]
    ,[システム使用区分１３]
    ,[システム使用区分１４]
    ,[システム使用区分１５]
    ,[登録種別]
    ,[登録日]
    ,[削除フラグ]
    ,[備考]
  FROM ${INFO_DB}.[T_KT41000D_LOAD]
)  AS PRT
INNER JOIN
(
  SELECT
     [CODCAIKBN001]                 AS  [コード階層区分１]
    ,[CODCAIMSO001]                 AS  [コード階層名称１]
    ,[CODCAIKBN002]                 AS  [コード階層区分２]
    ,[CODCAIMSO002]                 AS  [コード階層名称２]
    ,[CODCAIKBN003]                 AS  [コード階層区分３]
    ,[CODCAIMSO003]                 AS  [コード階層名称３]
    ,[CODCAIKBN004]                 AS  [コード階層区分４]
    ,[CODCAIMSO004]                 AS  [コード階層名称４]
    ,[SHNCOD]                       AS  [商品コード]
    ,[SHNMSO]                       AS  [商品名称]
    ,[SYSUSEKBN001]                 AS  [システム使用区分１]
    ,[SYSUSEKBN002]                 AS  [システム使用区分２]
    ,[SYSUSEKBN003]                 AS  [システム使用区分３]
    ,[SYSUSEKBN004]                 AS  [システム使用区分４]
    ,[SYSUSEKBN005]                 AS  [システム使用区分５]
    ,[SYSUSEKBN006]                 AS  [システム使用区分６]
    ,[SYSUSEKBN007]                 AS  [システム使用区分７]
    ,[SYSUSEKBN008]                 AS  [システム使用区分８]
    ,[SYSUSEKBN009]                 AS  [システム使用区分９]
    ,[SYSUSEKBN010]                 AS  [システム使用区分１０]
    ,[SYSUSEKBN011]                 AS  [システム使用区分１１]
    ,[SYSUSEKBN012]                 AS  [システム使用区分１２]
    ,[SYSUSEKBN013]                 AS  [システム使用区分１３]
    ,[SYSUSEKBN014]                 AS  [システム使用区分１４]
    ,[SYSUSEKBN015]                 AS  [システム使用区分１５]
    ,[TLKSBT]                       AS  [登録種別]
    ,[TRD]                          AS  [登録日]
    ,[KVX]                          AS  [更新日]
    ,[DELFLG]                       AS  [削除フラグ]
    ,[BKO]                          AS  [備考]
  FROM ${DB_T_SRC}.[T_KT41000D_SRC001]
  WHERE (SELECT CAST([前日] AS CHAR(8)) FROM ${INFO_DB}.[T_KT00060D_LOAD])
        BETWEEN [Start_Date] and [End_Date]
) AS MST
ON PRT.[商品コード]=MST.[商品コード]
CROSS JOIN ${INFO_DB}.[T_KT00060D_LOAD]  AS DTE
;
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/*#############################################*/
/* 新規商品コードを抽出                        */
/*#############################################*/
INSERT INTO ${INFO_DB}.[T_KT41000D_WK91]
SELECT
   [前日]
  ,[コード階層区分１]
  ,[コード階層名称１]
  ,[コード階層区分２]
  ,[コード階層名称２]
  ,[コード階層区分３]
  ,[コード階層名称３]
  ,[コード階層区分４]
  ,[コード階層名称４]
  ,[商品コード]
  ,[商品名称]
  ,[システム使用区分１]
  ,[システム使用区分２]
  ,[システム使用区分３]
  ,[システム使用区分４]
  ,[システム使用区分５]
  ,[システム使用区分６]
  ,[システム使用区分７]
  ,[システム使用区分８]
  ,[システム使用区分９]
  ,[システム使用区分１０]
  ,[システム使用区分１１]
  ,[システム使用区分１２]
  ,[システム使用区分１３]
  ,[システム使用区分１４]
  ,[システム使用区分１５]
  ,[登録種別]
  ,[前日]        AS [登録日]
  ,[前日]        AS [更新日]
  ,[削除フラグ]
  ,[備考]
FROM ${INFO_DB}.[T_KT41000D_LOAD]
    ,${INFO_DB}.[T_KT00060D_LOAD]
WHERE [商品コード] NOT IN
      (SELECT [SHNCOD]   AS  [商品コード]
         FROM ${DB_T_SRC}.[T_KT41000D_SRC001]
         WHERE (SELECT [前日] FROM ${INFO_DB}.[T_KT00060D_LOAD])
               BETWEEN [Start_Date] and [End_Date]
      )
;
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
