#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# =========================================================================
# 作成テーブル名称  :口座情報					| T_IM00010D_OBJ

# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :ＣＩＦワーク					| T_IM00011D_WK
#                   :流動性口座 					| V_YK51010D_SRCB00
#
# 変更履歴
# -------------------------------------------------------------------------
# 2021-10-15        :新規作成                       | ：meistier KIHARA
# =========================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/*   ST01                                                 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.T_IM00010D_WK
SELECT 0 AS [作成基準日],
       A.[店番],
       A.[科目],
       A.[口座番号],
       A.[ＣＩＦ番号] AS [店別顧客番号],
       0  AS [顧客番号],
       '' AS [カナ氏名],
       '' AS [漢字氏名],
       0 AS [生年月日]
FROM  ${INFO_DB}.V_YK51010D_SRCB00 AS A
LEFT JOIN
    (SELECT [店番], [科目], [口座番号], count(*) as [件数]
     FROM ${INFO_DB}.V_YK51010D_SRCB00
     GROUP BY [店番], [科目], [口座番号]
     HAVING [件数]>1) AS B
    ON A.[店番]=B.[店番]
    AND A.[科目]=B.[科目]
    AND A.[口座番号]=B.[口座番号]
WHERE NOT (B.[店番] IS NOT NULL AND [生死表示]=1);
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/*   ST01                                                 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.T_IM00010D_OBJ
SELECT B.[作成基準日],
       A.[店番],
       A.[科目],
       A.[口座番号],
       A.[ＣＩＦ番号] AS [店別顧客番号],
       B.[顧客番号],
       B.[カナ氏名],
       B.[漢字氏名],
       B.[生年月日]
FROM ${INFO_DB}.T_IM00010D_WK AS A
INNER JOIN ${INFO_DB}.T_IM00011D_WK     AS B
  ON (A.[店番] = B.[店番])
  AND (A.[ＣＩＦ番号] = B.[ＣＩＦ番号]);
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
