#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :債券残高断面展開                          | HN_INFO.T_KT13130D_OBJ
# フェーズ          :共通処理
# サイクル          :日次
# 参照テーブル      :債券明細断面展開                          | HN_INFO.T_KT13110D_OBJ
#                    債券銘柄基本断面展開                      | HN_INFO.T_KT13120D_OBJ
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024/10/22 新規作成                                          | H.Okura
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 債券銘柄基本断面展開 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_KT13130D_OBJ]
SELECT
    A.[作成基準日]              AS [作成基準日],
    A.[店番]                    AS [店番],
    A.[ＣＩＦ番号]              AS [ＣＩＦ番号],
    A.[債券通帳番号]            AS [債券通帳番号],
    A.[明細番号]                AS [明細番号],
    A.[生死表示]                AS [生死表示],
    A.[銘柄番号]                AS [銘柄番号],
    B.[銘柄コード]              AS [銘柄コード],
    B.[漢字銘柄名]              AS [漢字銘柄名],
    A.[額面]                    AS [額面],
    A.[販売受渡日]              AS [販売受渡日],
    B.[償還日]                  AS [償還日],
    B.[利金支払日前期＿月日]    AS [利金支払日前期＿月日],
    B.[利金支払日後期＿月日]    AS [利金支払日後期＿月日],
    B.[初回利払日]              AS [初回利払日]
FROM
    ${INFO_DB}.[T_KT13110D_OBJ] A
INNER JOIN
    ${INFO_DB}.[T_KT13120D_OBJ] B
    ON A.[作成基準日] = B.[作成基準日]
    AND A.[銘柄番号] = B.[銘柄番号];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
