#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :基準日テーブル作成                        | HN_INFO.T_KT90085D_OBJ
# フェーズ          :前処理
# サイクル          :日次
# 参照テーブル      :日付テーブル（ＣＩＦ残高）                | HN_INFO.T_KT90060D_OBJ
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024/07/08 新規作成                                          | TSUKINOKI
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 基準日テーブル作成 */
/* 期初日～最新断面（前日）までの基準日付を作成する */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_KT90085D_OBJ]
SELECT
   [基準日],
   [当月月初日],
   [期初日],
   [期末日],
   [基準日月中日数],
   [基準日期中日数],
   [前日]
FROM ${INFO_DB}.[T_KT90080D_OBJ]
WHERE [基準日] = (SELECT [前日] FROM ${INFO_DB}.[T_KT90060D_OBJ]);
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
