#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :預り資産計数ワーク(預り資産合計)          | HN_INFO.T_KT13070D_WK08
# フェーズ          :ＣＩＦ残高
# サイクル          :日次
# 参照テーブル      :預り資産計数ワーク                        | HN_INFO.T_KT13070D_WKnn
#
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024/10/30 新規作成                                          | H.Okura
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預り資産計数ワーク 預り資産合計 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_KT13070D_WK08]
SELECT
    MAX(ZN.[作成基準日])              AS [作成基準日],
    ZN.[店番]                         AS [店番],
    ZN.[ＣＩＦ番号]                   AS [ＣＩＦ番号],
    'ZZZZAZKRGOKEI'                   AS [商品コード],
    SUM(ZN.[残高])                    AS [残高],
    SUM(ZN.[月中積数])                AS [月中積数],
    SUM(ZN.[月中平残])                AS [月中平残],
    SUM(ZN.[期中積数])                AS [期中積数],
    SUM(ZN.[期中平残])                AS [期中平残]
FROM
(
    SELECT [作成基準日],[店番],[ＣＩＦ番号],[商品コード],[残高],
           [月中積数],[月中平残],[期中積数],[期中平残]
      FROM ${INFO_DB}.[T_KT11070D_WK31]
    UNION ALL
    SELECT * FROM ${INFO_DB}.[T_KT13070D_WK06]
    UNION ALL
    SELECT * FROM ${INFO_DB}.[T_KT13070D_WK07]
) AS ZN
GROUP BY ZN.[店番], ZN.[ＣＩＦ番号];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
