#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :業務支援系商品コード採番融資              | T_KT41010D_WK30
# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :制度融資商品内訳                          | T_SN00030D_001
#                   :日付                                      | T_KT00060D_LOAD
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2023-05-18        :新規作成                                  | KODAMA
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;

/* ****************************************************************** */
/* 制度融資コード情報                                             */
/* 自動設定(階層４のみ)                                           */
/* ****************************************************************** */

INSERT INTO ${INFO_DB}.[T_KT41000D_WK30]
SELECT
    T2.[前日]                        AS [作成基準日],
    'A'                              AS [コード階層区分１],
    '資金調達'                       AS [コード階層名称１],
    ''                               AS [コード階層区分２],
    ''                               AS [コード階層名称２],
    ''                               AS [コード階層区分３],
    ''                               AS [コード階層名称３],
    '0000' + LTRIM(RTRIM(T1.[制度融資コード])) AS [コード階層区分４],
    LTRIM(RTRIM(T1.[制度融資コード名称])) AS [コード階層名称４],
    LTRIM(RTRIM(T1.[制度融資コード])) AS [商品コード],
    LTRIM(RTRIM(T1.[制度融資コード名称])) AS [商品名称],
    ''                               AS [システム使用区分１],
    ''                               AS [システム使用区分２],
    ''                               AS [システム使用区分３],
    ''                               AS [システム使用区分４],
    ''                               AS [システム使用区分５],
    ''                               AS [システム使用区分６],
    ''                               AS [システム使用区分７],
    ''                               AS [システム使用区分８],
    ''                               AS [システム使用区分９],
    ''                               AS [システム使用区分１０],
    ''                               AS [システム使用区分１１],
    ''                               AS [システム使用区分１２],
    ''                               AS [システム使用区分１３],
    ''                               AS [システム使用区分１４],
    ''                               AS [システム使用区分１５],
    ''                               AS [登録種別],
    0                                AS [登録日],
    0                                AS [更新日],
    ''                               AS [削除フラグ],
    ''                               AS [備考]
FROM       ${INFO_DB}.[T_SN00030D_001]  AS T1
CROSS JOIN ${INFO_DB}.[T_KT00060D_LOAD] AS T2
WHERE LTRIM(RTRIM(T1.[制度融資コード名称])) <> ''
;
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;

/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;

/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;

/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
