#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【管理店】県外エリア管理店情報            | HN_INFO.T_KT05560D_OBJ
# フェーズ          :共通処理
# サイクル          :日次
# 参照テーブル      :【管理店】管理店名寄せ情報                | HN_INFO.T_KT05580D_OBJ
#                   :県外エリア管理店マスタ                    | HN_INFO.T_SN02020D_OBJ
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024/09/30 新規作成                                          | M.Shunya
# 2025/01/31 法人を名寄せしない                                | M.Shunya
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 【管理店】県外エリア管理店情報 作成、抽出 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_KT05560D_OBJ]
SELECT
      A.[統合番号],
      A.[店番],
      A.[ＣＩＦ番号],
      B.[管理店番],
      A.[住所コード],
      '07'         AS [管理店番チャネル区分]
FROM ${INFO_DB}.[T_KT05580D_OBJ] AS A
INNER JOIN (
   SELECT
         LEFT(dbo.FORMAT2([集約住所コード],'99999999999'),2) AS [住所コード上位２桁],
         [管理店番]
   FROM ${INFO_DB}.[T_SN02020D_OBJ]
   ) AS B
ON (A.[住所コード上位２桁] = B.[住所コード上位２桁])
WHERE A.[代表ＣＩＦフラグ] = '1'
   OR A.[法人個人コード] <> '01';
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
