#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :保険明細断面展開                          | HN_INFO.T_KT13170D_OBJ
# フェーズ          :共通処理
# サイクル          :日次
# 参照テーブル      :保険契約明細断面展開                      | HN_INFO.T_KT13150D_OBJ
#                    保険商品別通貨利率展開                    | HN_INFO.T_KT13160D_OBJ
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024/10/22 新規作成                                          | H.Okura
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 保険明細断面展開 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_KT13170D_OBJ]
SELECT
    A.[作成基準日]              AS [作成基準日],
    A.[ＣＩＦ店番]              AS [ＣＩＦ店番],
    A.[ＣＩＦ契約番号]          AS [ＣＩＦ契約番号],
    A.[通番]                    AS [通番],
    A.[商品属性コード]          AS [商品属性コード],
    A.[データ種類]              AS [データ種類],
    A.[資産性商品区分]          AS [資産性商品区分],
    A.[基本保険金通貨種類]      AS [基本保険金通貨種類],
    A.[基本保険金額]            AS [基本保険金額],
    CAST(A.[基本保険金額] AS DECIMAL(20,6)) * ISNULL(B.[レート],1)    AS [基本保険金額＿円貨],
    ISNULL(B.[レート],1)      AS [基本保険金額レート],
    A.[保険料通貨種類]          AS [保険通貨コード],
    A.[保険料],
    /* 保険料通貨種類コードが円の場合 */
    /* レートを掛けない               */
    CASE WHEN A.[保険料通貨種類]='0' THEN A.[保険料]
         ELSE CAST(A.[保険料] AS DECIMAL(20,6)) * ISNULL(C.[レート],1)
    END                       AS [保険料＿円貨],
    ISNULL(C.[レート],1)      AS [保険料レート]
FROM
    ${INFO_DB}.[T_KT13150D_OBJ] AS A
LEFT JOIN
    ${INFO_DB}.[T_KT13160D_OBJ] AS B
    ON A.[作成基準日]=B.[作成基準日]
    AND A.[商品属性コード]=B.[商品属性コード]
    AND A.[基本保険金通貨種類]=B.[保険通貨コード]
LEFT JOIN
    ${INFO_DB}.[T_KT13160D_OBJ] AS C
    ON A.[作成基準日]=C.[作成基準日]
    AND A.[商品属性コード]=C.[商品属性コード]
    AND A.[保険料通貨種類]=C.[保険通貨コード];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
