#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【管理店】貸出先管理店情報累積            | HN_INFO.T_KT15540D_001
# フェーズ          :共通処理
# サイクル          :日次
# 参照テーブル      :【管理店】貸出先管理店情報累積            | HN_INFO.T_KT15540D_001
#                   :【管理店】貸出先管理店情報                | HN_INFO.T_KT15540D_OBJ
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024/02/06 新規作成                                          | M.Shunya
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 【管理店】前月同日より前を削除、前日削除（再実行対応） */
/* ****************************************************************** */
DELETE FROM ${INFO_DB}.[T_KT15540D_001]
WHERE [作成基準日] < (SELECT CAST(CONVERT(CHAR(8), DATEADD(MONTH, -1, CAST([前日] AS CHAR(8))), 112) AS DECIMAL(8)) FROM ${INFO_DB}.[T_KT00060D_LOAD])
   OR [作成基準日] = (SELECT MAX([作成基準日]) FROM ${INFO_DB}.[T_KT15540D_OBJ]);
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
