#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【管理店】貸出先管理店情報累積            | HN_INFO.T_KT15540D_001
# フェーズ          :共通処理
# サイクル          :日次
# 参照テーブル      :【管理店】貸出先管理店情報                | HN_INFO.T_KT15540D_OBJ
#                   :【管理店】管理店情報                      | HN_INFO.T_KT15500D_OBJ
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024/02/06 新規作成                                          | M.Shunya
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 【管理店】前日管理店引継ぎ、新規管理店セット */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_KT15540D_001]
SELECT
     A.[作成基準日],
     A.[統合番号],
     A.[店番],
     A.[ＣＩＦ番号],
     CASE WHEN A.[管理店番] = 0
          THEN B.[管理店番]
          ELSE A.[管理店番]
     END AS [管理店番],
     A.[残高],
     A.[管理店番チャネル区分]
FROM ${INFO_DB}.[T_KT15540D_OBJ] AS A
INNER JOIN ${INFO_DB}.[T_KT15500D_OBJ] AS B
ON (A.[店番] = B.[店番]
AND A.[ＣＩＦ番号] = B.[ＣＩＦ番号])
;
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
