#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# =========================================================================
# 作成テーブル名称  :名寄せインデックス作成		| T_NY08000D_OBJ	
# フェーズ          :テーブル作成
# サイクル          :日次
# 実行日            :
# 参照テーブル      :名寄せ入力データ(本部のみ)	| T_NY02000D_OBJ1
#                   :【管理店】管理店情報_バッチ| T_KT15500D_OBJ
#
# 変更履歴
# -------------------------------------------------------------------------
# 2024-11-11        :新規作成                   | Shunya.M
# =========================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 300 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
INSERT INTO ${INFO_DB}.[T_NY08000D_OBJ]
SELECT
    A.[作成基準日],
    A.[店番],
    A.[ＣＩＦ番号],
    A.[統合ＣＩＦ番号],
    A.[代表ＣＩＦフラグ],
    0 AS [世帯番号],
    '' AS [世帯代表フラグ],
    COALESCE(B.[管理店番],A.[店番]) AS [管理店番],
    1 AS [保有ＣＩＦ数],
    1 AS [取引店舗数],
    1 AS [世帯保有ＣＩＦ数],
    1 AS [世帯取引店舗数],
    A.[生死表示],
    A.[漢字氏名],
    A.[カナ氏名],
    A.[名寄せ用カナ氏名],
    A.[法個人区分],
    A.[法人個人コード],
    A.[業種コード],
    A.[電話番号],
    A.[住所コード],
    A.[漢字住所],
    A.[補助住所]
FROM ${INFO_DB}.[T_NY02000D_OBJ1] AS A
LEFT JOIN ${INFO_DB}.[T_KT15500D_OBJ] AS B
    ON (A.[店番] = B.[店番]
    AND A.[ＣＩＦ番号] = B.[ＣＩＦ番号]);
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
