#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :事業資金積数                              | HN_INFO.T_NY03001D_WK
# フェーズ          :計数集計
# サイクル          :日次
# 参照テーブル      :外貨月中積数                              | HN_INFO.T_NY03610D_OBJ 
#                    日付テーブル                              | HN_INFO.T_KT00060D_LOAD
# 変更履歴
# ------------------------------------------------------------------------------
# 2023-02-06        :新規作成                                  | Nagata
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* GDKA異動明細（残高） */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03001D_WK]
SELECT
   T2.[前日]               AS [作成基準日],
   T1.[取次店番]           AS [店番],
   T1.[国内取引先番号]     AS [ＣＩＦ番号],
   T1.[科目コード内部]     AS [科目],
   0                      AS [取扱番号],
   T1.[取組番号]           AS [取組番号],
   T1.[通貨コード]         AS [通貨コード],
   T1.[復活番号]           AS [復活番号],
   T1.[外為店番]           AS [外為店番],
   ''                     AS [法個人コード],
   ''                     AS [業種コード],
   ''                     AS [カードローンコード],
   ''                     AS [付保証コード],
   ''                     AS [商品コード１],
   ''                     AS [商品コード２],
   ''                     AS [商品コード３],
   ''                     AS [商品コード４],
   ''                     AS [商品コード５],
   ''                     AS [商品コード６],
   T1.[月中積数]           AS [月中積数],
   '8'                    AS [作成ＳＱＬ番号]
FROM ${INFO_DB}.[T_NY03610D_OBJ]        AS T1
CROSS JOIN ${INFO_DB}.[T_KT00060D_LOAD] AS T2;
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
