#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# =========================================================================
# 作成テーブル名称  :世帯番号マージWK			| T_NY06201D_WK1	
# フェーズ          :テーブル作成
# サイクル          :日次
# 実行日            :
# 参照テーブル      :世帯番号マージ				| T_NY06200D_OBJ
#                   :世帯名寄せ採番n			| T_NY06100D_OBJn
# 変更履歴
# -------------------------------------------------------------------------
# 2022-03-31        :新規作成                   | Shunya.M
# =========================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 300 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
DELETE FROM ${INFO_DB}.[T_NY06201D_WK1];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/* #                世帯番号 ループ ${STI_CTR} 回目  マージ 初期処理                # */
/* ######################################################################### */
INSERT INTO ${INFO_DB}.[T_NY06201D_WK1]
SELECT
    A.[統合ＣＩＦ番号],
    A.[世帯番号] AS [世帯番号１],
    B.[世帯番号] AS [世帯番号２]
FROM ${INFO_DB}.[T_NY06200D_OBJ] AS A
INNER JOIN ${INFO_DB}.[T_NY06100D_${EXT_ID}] AS B
    ON (A.[統合ＣＩＦ番号] = B.[統合ＣＩＦ番号]);
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
