#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :預り資産残高抽出                          | HN_INFO.T_NY03000D_WK4
# フェーズ          :預り資産残高抽出
# サイクル          :日次
# 参照テーブル      :預り資産残高                              | HN_INFO.T_NY03002D_WK
#                   :日付テーブル                              | HN_INFO.T_KT00060D_LOAD
# ------------------------------------------------------------------------------
# 2023-02-07        :新規作成                                  | Nagata
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* BRKA債券明細S */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.T_NY03000D_WK4
SELECT
   MAX(A.[作成基準日])                               AS [作成基準日],
   A.[店番]                                         AS [店番],
   A.[ＣＩＦ番号]                                   AS [ＣＩＦ番号],
   ''                                               AS [統合ＣＩＦ番号],
   ''                                               AS [代表ＣＩＦフラグ],
   0                                                AS [ＣＩＦ開設日],
   '0'                                              AS [事業資金貸出フラグ],
   '0'                                              AS [住宅ローンフラグ],
   '0'                                              AS [住公契約フラグ],
   SUM([残高])                                      AS [預かり資産残高],
   '0'                                              AS [給振フラグ],
   '0'                                              AS [年金フラグ],
   0                                                AS [公共料金自振数],
   0                                                AS [ローン取引数],
   0                                                AS [機能サービス数]
FROM       ${INFO_DB}.T_NY03002D_WK                AS A
GROUP BY A.[店番],A.[ＣＩＦ番号];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
