#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# =========================================================================
# 作成テーブル名称  :世帯代表集計				| T_NY07100D_OBJ
# フェーズ          :テーブル作成
# サイクル          :日次
# 実行日            :
# 参照テーブル      :名寄せ代表選定情報			| HN_INFO.T_NY03000D_OBJ
#    
# 変更履歴
# -------------------------------------------------------------------------
# 2022-06-26        :新規作成                   | Shunya.M
# =========================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 300 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
INSERT INTO ${INFO_DB}.T_NY07100D_OBJ
SELECT
    [作成基準日],
    [統合ＣＩＦ番号],
    MAX([事業資金貸出フラグ]) AS [事業資金貸出フラグ],
    MAX([住宅ローンフラグ]) AS [住宅ローンフラグ],
    MAX([住公契約フラグ]) AS [住公契約フラグ],
    CAST(SUM([預かり資産残高]) / 1000000.00000 AS INTEGER) AS [預かり資産残高１００万],
    MAX([給振フラグ]) AS [給振フラグ],
    MAX([年金フラグ]) AS [年金フラグ],
    SUM([公共料金自振数]) AS [公共料金自振数],
    SUM([ローン取引数]) AS [ローン取引数],
    SUM([機能サービス数]) AS [機能サービス数],
    MAX([ＣＩＦ開設日]) AS [ＣＩＦ開設日],
    COUNT(*) AS [ＣＩＦ数]
FROM ${INFO_DB}.T_NY03000D_OBJ
GROUP BY [作成基準日],[統合ＣＩＦ番号];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
