#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :預かり資産残高                    | HN_INFO.T_NY03002D_WK
# フェーズ          :預かり資産残高
# サイクル          :日次
# 参照テーブル      :預かり資産残高＿流動                      | HN_INFO.T_NY03002D_WK1
#                   :預かり資産残高＿定期                      | HN_INFO.T_NY03002D_WK2
#                   :預かり資産残高＿外貨                      | HN_INFO.T_NY03002D_WK3
#                   :預かり資産残高＿投信                      | HN_INFO.T_NY03002D_WK4
#                   :預かり資産残高＿一時払保険                | HN_INFO.T_NY03002D_WK5
#                   :預かり資産残高＿九州ＦＧ投信              | HN_INFO.T_NY03002D_WK6
#                   :預かり資産残高＿九州ＦＧ債券              | HN_INFO.T_NY03002D_WK7
#                   :預かり資産残高＿債券                      | HN_INFO.T_NY03002D_WK8
# ------------------------------------------------------------------------------
# 2023-02-07        :新規作成                                  | Nagata
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿流動マージ */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK1];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿定期マージ */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK2];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿外貨マージ */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK3];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿投信 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK4];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿一時払保険 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK5];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿九州ＦＧ投信 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK6];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿九州ＦＧ債券 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK7];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 預かり資産残高＿債券 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_NY03002D_WK] SELECT * FROM ${INFO_DB}.[T_NY03002D_WK8];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
