#!/bin/sh
# =========================================================================
# 作成テーブル名称  :CIF取消処理確認用世帯親情報	|	T_SN00040D
# フェーズ          :テーブル作成
# サイクル          :日次
# 実行日            :DAYAFTER(火曜日～土曜日）
# 参照テーブル      :世帯名寄せ情報			|	T_CM02010D_OBJ
#
# 備考              :
#
# 変更履歴
# -------------------------------------------------------------------------
# 2022-2-17         :新規作成				|	AID T.Ikeda
# 2022-7-21         :OUT修正				|	AID T.Ikeda
# =========================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/*    世帯名寄せ情報より対象抽出                                  */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_SN00040D_WK]
      SELECT  [店番],
              [ＣＩＦ番号]
      FROM    ${INFO_DB}.[T_CM02010D_OBJ]
      WHERE ([代表フラグ]=1) AND ([世帯番号]<>0)
;
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
