#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【CC】顧客商品契約有無情報                | T_SN30100D_WK7
# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :リアルタイム口振                          | V_YK51630D_SRCB01
#
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2021-08-23        :新規作成                                  | SVC TSUKINOKI
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 【CC】顧客商品有無情報作成（商品追加＿機能サービス） */
/*  リアルタイム口振 (PayB) */
/* ****************************************************************** */
/* ******************************** */
/* 前日データと累積データのマージ */
/* ******************************** */
INSERT INTO ${INFO_DB}.[T_SN30100D_RTKWK2]
SELECT
    T2.[前日],
    T1.[店番],
    T1.[ＣＩＦ番号],
    '',
    T1.[商品コード]
FROM
(
  /* 前日データ */
  SELECT [店番],[ＣＩＦ番号],[商品コード] FROM ${INFO_DB}.[T_SN30100D_RTKWK1]
  UNION
  /* 累積データ */
  SELECT [店番],[ＣＩＦ番号],[商品コード] FROM ${INFO_DB}.[T_SN30100D_RTK]
) AS T1
CROSS JOIN ${INFO_DB}.[T_KT00060D_LOAD] AS T2;
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
