#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【顧客商品有無】信託業務(X-NET)           | T_SN25200D_WK1
# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :金銭信託情報累積                          | V_SN02750D_SHN
#                   :日付テーブル                              | HN_INFO.T_KT00060D_LOAD
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024-02-06        :新規作成                                  | KOZAKI
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 【顧客商品有無】信託業務(X-NET) 金銭信託情報累積（契）・（受） */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_SN25200D_WK1]
SELECT
   (SELECT [前日] FROM ${INFO_DB}.[T_KT00060D_LOAD]) AS [作成基準日],
   Z.[店番] AS [店番],
   Z.[ＣＩＦ番号] AS [ＣＩＦ番号],
   Z.[商品コード] AS [商品コード]
FROM
(
  /* 金銭信託 */
  SELECT
    [店番],
    [ＣＩＦ番号],
    CASE WHEN [受益権階層コード] = '1' THEN '3060100000000'
         ELSE '3060200000000'
    END AS [商品コード]
  FROM ${INFO_DB}.[V_SN02750D_SHN]
  WHERE [受益権階層コード] IN ('1','2','3','4')
) AS Z
GROUP BY Z.[店番], Z.[ＣＩＦ番号], Z.[商品コード];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
