#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【顧客商品有無】でんさい                   | HN_INFO.T_SN25400D_OBJ
# フェーズ          :でんさい商品契約有無を判定
# サイクル          :日次
# 参照テーブル      :でんさい情報                               | HN_INFO.T_KS36500D_LOAD
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2025/05/08 新規作成                                           | Shunya.M
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 顧客商品契約有無情報_でんさい作成 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_SN25400D_OBJ]
SELECT
    H.[前日]                        AS [作成基準日],
    A.[店番]                        AS [店番],
    A.[ＣＩＦ番号]                  AS [ＣＩＦ番号],
    'B040000000000'                 AS [商品コード]
FROM ${INFO_DB}.[T_KS36500D_LOAD] AS A
CROSS JOIN ${INFO_DB}.[T_KT00060D_LOAD] AS H
WHERE [レコード識別] = '2'
  AND [エラー表示１] = ''
  AND [エラー表示２] = ''
  AND [エラー表示３] = ''
  AND [エラー表示４] = ''
  AND [エラー表示５] = ''
  AND [エラー表示６] = ''
GROUP BY H.[前日],A.[店番],A.[ＣＩＦ番号];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
