#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【顧客商品契約有無情報】X-NET               | T_SN25200D_OBJ
# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :【顧客商品有無】信託業務(X-NET)             | T_SN25200D_WK1
#                   :【顧客商品有無】資産運用＿商品ベース(X-NET) | T_SN25200D_WK2
#
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2024-02-06        :新規作成                                    | KOZAKI
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 【顧客商品有無】マージ(X-NET) */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_SN25200D_OBJ]
SELECT [作成基準日], [店番], [ＣＩＦ番号], [商品コード] FROM ${INFO_DB}.[T_SN25200D_WK1]
UNION
SELECT [作成基準日], [店番], [ＣＩＦ番号], [商品コード] FROM ${INFO_DB}.[T_SN25200D_WK2];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
