#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# =========================================================================
# 作成テーブル名称  :証券預り資産残高			|	T_SN02400D_OBJ
# フェーズ          :目的別テーブル作成（連番付与）
# サイクル          :日次
# 実行日            :毎日（DAY365）
# 参照テーブル      :証券預り資産残高ロード		|	T_SN02400D_LOAD
#
# 備考              :
#
# 変更履歴
# -------------------------------------------------------------------------
# 2017-10-11         :新規作成				|	AID Hirose
#
# =========================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/*              目的別テーブルクリア                              */
/* ****************************************************************** */
DELETE FROM [${INFO_DB}].[T_SN02400D_OBJ];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/*              目的別テーブル作成                                */
/* ****************************************************************** */
INSERT INTO [${INFO_DB}].[T_SN02400D_OBJ]
SELECT
    dbo.FORMAT2([外部残高ＩＤ],'XXXXXXXXXXXXX') + CAST(ROW_NUMBER() OVER(PARTITION BY [基準年月日] ORDER BY [外部残高ＩＤ], [口座番号], [銘柄名]) AS VARCHAR(7)),
    [基準年月日],
    [ユーザコード],
    [口座番号],
    [部店コード],
    [商品コード],
    [銘柄コード],
    [銘柄名],
    [商品詳細],
    [買付約定日],
    [数量],
    [取得レート],
    [評価額],
    [評価損益],
    [為替＿評価レート],
    [発行通貨],
    [評価額＿外貨],
    [単価],
    [外貨平均買付単価],
    [預り日],
    [保護代用区分],
    [特定預り区分],
    [預り詳細区分],
    [取得金額],
    [平均取得単価＿取得コスト],
    [時価＿参考時価],
    [建区分],
    [建市場],
    [債券格付＿Ｒ&Ｉ],
    [債券格付＿ＪＣＲ],
    [債券格付＿Ｓ&Ｐ],
    [債券格付＿ＭｏｏｄｙＳ],
    [利率],
    [利払日],
    [償還日],
    [決算日]
FROM
    [${INFO_DB}].[T_SN02400D_LOAD];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
