#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :【CC】顧客商品契約有無情報                | T_SN30100D_WK7
# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :リアルタイム口振                          | V_YK51630D_SRCB01
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2021-08-23        :新規作成                                  | SVC TSUKINOKI
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 【CC】顧客商品有無情報作成（商品追加＿機能サービス） */
/* ****************************************************************** */
/* ******************************** */
/* リアルタイム口振商品契約有無から
/* 顧客商品契約有無情報作成
/* ******************************** */
INSERT INTO ${INFO_DB}.[T_SN30100D_WK7]
SELECT
   A.[作成基準日]
  ,A.[店番]
  ,A.[ＣＩＦ番号]
  ,B.[統合ＣＩＦ番号]
  ,A.[商品コード]
FROM
(
   /* 累積テーブルから最新断面を抽出し統合CIFを結合 */
   SELECT
      [作成基準日]
     ,[店番]
     ,[ＣＩＦ番号]
     ,[商品コード]
   FROM ${INFO_DB}.[T_SN30100D_RTK]
   WHERE [作成基準日] = (SELECT [前日] FROM ${INFO_DB}.[T_KT00060D_LOAD])
) AS A
INNER JOIN
(
   SELECT
      [店番]
     ,[ＣＩＦ番号]
     ,[統合ＣＩＦ番号]
   FROM ${INFO_DB}.[V_MA00030D_SRCB01]
) AS B
ON  A.[店番]=B.[店番]
AND A.[ＣＩＦ番号]=B.[ＣＩＦ番号];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
