#!/bin/sh
. "/home/ec2-user/kyo/logger.sh"

# スクリプト自身のパスを取得（bashでも.でも動く）
script_path="$(realpath "${BASH_SOURCE[0]:-${0}}")"

log_exec "$script_path" "$@"

# ==============================================================================
# 作成テーブル名称  :顧客商品契約有無情報                      | T_SN30100D_WK0
# フェーズ          :テーブル作成
# サイクル          :日次
# 参照テーブル      :顧客商品契約有無情報ロード用              | T_SN30101D_LOAD
#                   :CDKA同一人名寄せ                          | V_MA00030D_SRCB01
#
# 変更履歴
# ------------------------------------------------------------------------------
# 2021-08-05        :新規作成                                  | SVC TSUKINOKI
# 2025-05-26        :協24-059-02_CRM機能改善（画面表示改善およびデータ連携強化）   | Shunya.M
# ===============================================================================
#
#  ＳＱＬ実行
#

sqlcmd -S ${SQL_SERVER} -d ${SQL_DB} -U ${SQL_USER} -P ${SQL_PASS} -f ${CHARSET} -t 0 -e -w 254 -b -N o -Q "
DECLARE @ExitCode INT;
DECLARE @ErrorCode INT;
SET @ExitCode = 0;
SELECT GETDATE() AS [DATE];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ****************************************************************** */
/* 顧客商品契約有無情報 */
/* ****************************************************************** */
INSERT INTO ${INFO_DB}.[T_SN30100D_WK0]
SELECT
   A.[前日]                           AS [作成基準日],
   A.[店番]                           AS [店番],
   A.[ＣＩＦ番号]                     AS [ＣＩＦ番号],
   B.[統合ＣＩＦ番号]                 AS [統合ＣＩＦ番号],
   TRIM(A.[商品コード]) + '00000000'  AS [商品コード]
FROM
  (
    SELECT
         T2.[前日],
         T1.[店番],
         T1.[ＣＩＦ番号],
         T1.[商品コード]
    FROM ${INFO_DB}.[T_SN30101D_LOAD]       AS T1
    CROSS JOIN ${INFO_DB}.[T_KT00060D_LOAD] AS T2
    WHERE T1.[商品コード] NOT IN ('10100','10200','10201','10202','10203')
  ) AS A
  INNER JOIN
  (
    SELECT
         [店番],
         [ＣＩＦ番号],
         [統合ＣＩＦ番号]
    FROM ${INFO_DB}.[V_MA00030D_SRCB01]
  ) AS B
  ON  A.[店番]=B.[店番]
  AND A.[ＣＩＦ番号]=B.[ＣＩＦ番号];
SELECT @ErrorCode = @@ERROR;
IF @ErrorCode <> 0 GOTO ENDPT;
/* ######################################################################### */
/*                               通常の退出処理                              */
/* ######################################################################### */
SELECT GETDATE() AS [DATE];
SET @ExitCode = 0;
GOTO Final;
/* ######################################################################### */
/*                           エラー発生時の退出処理                          */
/* ######################################################################### */
ENDPT:
SELECT GETDATE() AS [DATE];
SET @ExitCode = 8;
GOTO Final;
/* ######################################################################### */
/*                    処理を終了し、終了コードを返却する                       */
/* ######################################################################### */
Final:
:EXIT(SELECT @ExitCode)
"


#
exit $?
